Revit 2026 API

# MEPAnalyticalConnectionTypeCreate Method

---

Creates an analytical connection type element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static MEPAnalyticalConnectionType Create(
	Document doc,
	string name
)
```
```vb
Public Shared Function Create (
	doc As Document,
	name As String
) As MEPAnalyticalConnectionType
```
```cpp
public:
static MEPAnalyticalConnectionType^ Create(
	Document^ doc,
	String^ name
)
```
```fsharp
static member Create :
        doc : Document *
        name : string -> MEPAnalyticalConnectionType
```

#### Parameters

doc Document
     The document.
name String
     The name of the analytical type to be created.

#### Return Value

MEPAnalyticalConnectionType The created analytical connection type element.

| Exception | Condition |
| --- | --- |
| ArgumentException | This name is already used by an existing analytical connection type in the document. -or- name cannot include prohibited characters, such as "{, }, [, ], | , ;, less-than sign, greater-than sign, ?, `, ~". -or- name is an empty string. |
| ArgumentNullException | A non-optional argument was null |

The newly created type would have the default pressure loss being 0. Use ElementType.duplicate to copy from any existing type.

#### Reference

MEPAnalyticalConnectionType Class

Autodesk.Revit.DB Namespace